yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/ir/inc/rtl_ir.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_IR_H
#define RTL_IR_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#if defined (CONFIG_SOC_SERIES_RTL87X2G)
#include "ir/src/rtl87x2g/rtl_ir_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3E)
#include "ir/src/rtl87x3e/rtl_ir_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3D)
#include "ir/src/rtl87x3d/rtl_ir_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL8762J)
#include "ir/src/rtl87x2j/rtl_ir_def.h"
#endif

/** \defgroup IR          IR
  * \brief
  * \{
  */

/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup IR_Exported_Constants IR Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    IR_FIFO_Size IR FIFO Size
 * \{
 * \ingroup     IR_Exported_Constants
 */
#define IR_TX_FIFO_SIZE                   32  //!< I2C TX FIFO SIZE is 32.
#define IR_RX_FIFO_SIZE                   32  //!< I2C RX FIFO SIZE is 32.

/** End of IR_FIFO_Size
  * \}
  */

/**
 * \defgroup    IR_Mode IR Mode
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_MODE_TX = 0x00, //!< IR TX mode.
    IR_MODE_RX = 0x01, //!< IR RX mode.
} IRMode_TypeDef;

#define IS_IR_MODE(MODE) (((MODE) == IR_MODE_TX) || ((MODE) == IR_MODE_RX)) //!< Check if the input parameter is valid.

/** End of IR_Mode
  * \}
  */

/**
 * \defgroup    IR_Idle_Status IR Idle Status
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_IDLE_OUTPUT_LOW = 0x00,  //!< TX output high level in idle.
    IR_IDLE_OUTPUT_HIGH = 0x01, //!< TX output low level in idle.
} IRIdleStatus_TypeDef;

#define IS_IR_IDLE_STATUS(LEVEL) (((LEVEL) == IR_IDLE_OUTPUT_HIGH) || ((LEVEL) == IR_IDLE_OUTPUT_LOW)) //!< Check if the input parameter is valid.

/** End of IR_Idle_Status
  * \}
  */

/**
 * \defgroup    IR_TX_Data_Type IR TX Data Type
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_TX_DATA_NORMAL = 0x00,  //!< Not inverse TX FIFO define.
    IR_TX_DATA_INVERSE = 0x01, //!< Inverse TX FIFO define.
} IRTxDataType_TypeDef;

#define IS_IR_TX_DATA_TYPE(TYPE) (((TYPE) == IR_TX_DATA_NORMAL) || ((TYPE) == IR_TX_DATA_INVERSE)) //!< Check if the input parameter is valid.

/** End of IR_TX_Data_Type
  * \}
  */

/**
 * \defgroup    IR_Threshold IR Threshold
 * \{
 * \ingroup     IR_Exported_Constants
 */
#define IS_IR_TX_THRESHOLD(THD)  ((THD) <= IR_TX_FIFO_SIZE) //!< IR TX Threshold must range from 0 to 32.
#define IS_IR_RX_THRESHOLD(THD) ((THD) <= IR_RX_FIFO_SIZE)  //!< IR RX Threshold must range from 0 to 32.

/** End of IR_Threshold
  * \}
  */

/**
 * \defgroup    IR_RX_Start_Mode IR RX Start Mode
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_RX_MANUAL_MODE = 0x00, //!< Manual mode.
    IR_RX_AUTO_MODE = 0x01,   //!< Auto mode.
} IRRxStartMode_TypeDef;

#define IS_RX_START_MODE(MODE) (((MODE) == IR_RX_AUTO_MODE) || ((MODE) == IR_RX_MANUAL_MODE)) //!< Check if the input parameter is valid.

/** End of RX_Start_Mode
  * \}
  */

/**
 * \defgroup    IR_RX_FIFO_Discard_Setting IR RX FIFO Discard Setting
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_RX_FIFO_FULL_DISCARD_NEWEST = 0x00, //!< Discard oldest data in FIFO when RX FIFO is full and new data send to FIFO.
    IR_RX_FIFO_FULL_DISCARD_OLDEST = 0x01, //!< Reject new data data send to FIFO when RX FIFO is full.
} IRRxFifoDiscardSetting_TypeDef;

#define IS_IR_RX_FIFO_FULL_CTRL(CTRL)  (((CTRL) == IR_RX_FIFO_FULL_DISCARD_NEWEST) || ((CTRL) == IR_RX_FIFO_FULL_DISCARD_OLDEST)) //!< Check if the input parameter is valid.

/** End of IR_RX_FIFO_Discard_Setting
  * \}
  */

/**
 * \defgroup    IR_RX_Trigger_Mode IR RX Trigger Mode
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_RX_FALL_EDGE = 0x00,   //!< IR RX trigger mode is falling edge trigger.
    IR_RX_RISING_EDGE = 0x01, //!< IR RX trigger mode is rising edge trigger.
    IR_RX_DOUBLE_EDGE = 0x02, //!< IR RX trigger mode is double edge trigger.
} IRRxTriggerMode_TypeDef;

#define IS_RX_RX_TRIGGER_EDGE(EDGE) (((EDGE) == IR_RX_FALL_EDGE) || ((EDGE) == IR_RX_RISING_EDGE) || ((EDGE) == IR_RX_DOUBLE_EDGE)) //!< Check if the input parameter is valid.

/** End of RX_Trigger_Mode
  * \}
  */

/**
 * \defgroup    IR_RX_Filter_Time IR RX Filter Time
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_RX_FILTER_TIME_50ns  = 0x00, //!< IR RX filter time is 50ns.
    IR_RX_FILTER_TIME_75ns  = 0x01, //!< IR RX filter time is 75ns.
    IR_RX_FILTER_TIME_100ns = 0x02, //!< IR RX filter time is 100ns.
    IR_RX_FILTER_TIME_125ns = 0x03, //!< IR RX filter time is 125ns.
    IR_RX_FILTER_TIME_150ns = 0x04, //!< IR RX filter time is 150ns.
    IR_RX_FILTER_TIME_175ns = 0x05, //!< IR RX filter time is 175ns.
    IR_RX_FILTER_TIME_200ns = 0x06, //!< IR RX filter time is 200ns.
    IR_RX_FILTER_TIME_225ns = 0x07, //!< IR RX filter time is 225ns.
} IRRxFilterTime_TypeDef;

#define IS_IR_RX_FILTER_TIME_CTRL(CTRL)  (((CTRL) == IR_RX_FILTER_TIME_50ns) || \
                                          ((CTRL) == IR_RX_FILTER_TIME_75ns) || \
                                          ((CTRL) == IR_RX_FILTER_TIME_100ns) || \
                                          ((CTRL) == IR_RX_FILTER_TIME_125ns) || \
                                          ((CTRL) == IR_RX_FILTER_TIME_150ns) || \
                                          ((CTRL) == IR_RX_FILTER_TIME_175ns) || \
                                          ((CTRL) == IR_RX_FILTER_TIME_200ns) || \
                                          ((CTRL) == IR_RX_FILTER_TIME_225ns)) //!< Check if the input parameter is valid.

/** End of RX_Filter_Time
  * \}
  */

/**
 * \defgroup    IR_RX_Counter_Level IR RX Counter Level
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_RX_Count_Low_Level  = 0x00,  //!< RX level timeout interrupt is low level trigger.
    IR_RX_Count_High_Level  = 0x01, //!< RX level timeout interrupt is high level trigger.
} IRRxCounterThresholdType_TypeDef;

#define IS_IR_RX_COUNT_LEVEL_CTRL(CTRL)  (((CTRL) == IR_RX_Count_Low_Level) || ((CTRL) == IR_RX_Count_High_Level)) //!< Check if the input parameter is valid.

/** End of IR_RX_Counter_Level
  * \}
  */

/**
 * \defgroup    IR_Compensation_Flag IR Compensation Flag
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_COMPEN_FLAG_1_2_CARRIER = BIT28,            //!< 1/2 carrier cycle.
    IR_COMPEN_FLAG_1_4_CARRIER = BIT29,            //!< 1/4 carrier cycle.
    IR_COMPEN_FLAG_1_N_SYSTEM_CLK = BIT28 | BIT29, //!< 1/N carrier cycle.
} IRTxCompen_TypeDef;

