yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/ir/inc/rtl_ir.h
/** End of IR_Compensation_Flag
  * \}
  */

#if IR_SUPPORT_TX_MODE_CONFIG
/**
 * \defgroup    IR_Compensation_Flag IR Compensation Flag
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_TX_PUSH_PULL,
    IR_TX_OPEN_DRAIN,
} IRTxOutputMode_TypeDef;

/** End of IR_Compensation_Flag
  * \}
  */
#endif

/**
 * \defgroup    IR_RX_Counter_Threshold IR RX Counter Threshold
 * \{
 * \ingroup     IR_Exported_Constants
 */
#define IS_IR_RX_COUNTER_THRESHOLD(THD) ((THD) <= 0x7fffffffUL) //!< IR RX counter threshold value must range from 0x0 to 0x7FFFFFFF.

/** End of IR_RX_Counter_Threshold
  * \}
  */

/**
 * \defgroup    IR_Interrupt IR Interrupt
 * \{
 * \ingroup     IR_Exported_Constants
 */
/* All interrupts in transmission mode */
#define IR_INT_TF_EMPTY                             BIT0 //!< TX FIFO empty interrupt source.
#define IR_INT_TF_LEVEL                             BIT1 //!< TX FIFO threshold interrupt source.
#define IR_INT_TF_OF                                BIT4 //!< TX FIFO overflow interrupt source.
#if (IR_SUPPORT_TX_FINISH_INTERRUPT == 1)
#define IR_INT_TX_FINISH                            BIT5
#endif

/* All interrupts in receiving mode */
#define IR_INT_RF_FULL                              BIT0 //!< RX FIFO full interrupt source.
#define IR_INT_RF_LEVEL                             BIT1 //!< RX FIFO threshold interrupt source.
#define IR_INT_RX_CNT_OF                            BIT2 //!< RX counter overflow interrupt source.
#define IR_INT_RF_OF                                BIT3 //!< RX FIFO overflow interrupt source.
#define IR_INT_RX_CNT_THR                           BIT4 //!< RX counter timeout interrupt source.
#define IR_INT_RF_ERROR                             BIT5 //!< RX FIFO error read interrupt source. Trigger when RX FIFO empty and read RX FIFO.
#define IR_INT_RISING_EDGE                          ((uint32_t)(IR_RX_EXTENSION_INT | BIT1)) //!< RX rising edge interrupt source.
#define IR_INT_FALLING_EDGE                         ((uint32_t)(IR_RX_EXTENSION_INT | BIT0)) //!< RX falling edge interrupt source.

#if (IR_SUPPORT_TX_FINISH_INTERRUPT == 1)
#define IS_IR_TX_INT_CONFIG(CONFIG)   (((CONFIG) == IR_INT_TF_EMPTY)   || \
                                       ((CONFIG) == IR_INT_TF_LEVEL)   || \
                                       ((CONFIG) == IR_INT_TF_OF)      || \
                                       ((CONFIG) == IR_INT_TX_FINISH)) //!< Check if the input parameter is valid.
#else
#define IS_IR_TX_INT_CONFIG(CONFIG)   (((CONFIG) == IR_INT_TF_EMPTY)   || \
                                       ((CONFIG) == IR_INT_TF_LEVEL)   || \
                                       ((CONFIG) == IR_INT_TF_OF))) //!< Check if the input parameter is valid.
#endif

#define IS_IR_RX_INT_CONFIG(CONFIG)   (((CONFIG) == IR_INT_RF_FULL)     || \
                                       ((CONFIG) == IR_INT_RF_LEVEL)   || \
                                       ((CONFIG) == IR_INT_RX_CNT_OF)  || \
                                       ((CONFIG) == IR_INT_RF_OF)      || \
                                       ((CONFIG) == IR_INT_RX_CNT_THR) || \
                                       ((CONFIG) == IR_INT_RF_ERROR)      || \
                                       ((CONFIG) == IR_INT_RISING_EDGE) || \
                                       ((CONFIG) == IR_INT_FALLING_EDGE)) //!< Check if the input parameter is valid.
#define IS_IR_INT_CONFIG(CONFIG)      (IS_IR_TX_INT_CONFIG(CONFIG) || IS_IR_RX_INT_CONFIG(CONFIG)) //!< Check if the input parameter is valid.

/** End of IR_Interrupt
  * \}
  */

/**
 * \defgroup    IR_Interrupts_Clear_Flag IR Interrupts Clear Flag
 * \{
 * \ingroup     IR_Exported_Constants
 */
/* Clear all interrupts in transmission mode */
#define IR_TF_CLR                                   BIT0  //!< Clear TX FIFO interrupt status.
#define IR_INT_TF_EMPTY_CLR                         BIT1  //!< Clear TX FIFO empty interrupt status.
#define IR_INT_TF_LEVEL_CLR                         BIT2  //!< Clear TX FIFO threshold interrupt status.
#define IR_INT_TF_OF_CLR                            BIT3  //!< Clear TX FIFO overflow interrupt status.
#if (IR_SUPPORT_TX_FINISH_INTERRUPT == 1)
#define IR_INT_TX_FINISH_CLR                        BIT4
#endif

#if (IR_SUPPORT_TX_FINISH_INTERRUPT == 1)
#define IR_TX_INT_ALL_CLR                  (IR_INT_TF_EMPTY_CLR | \
                                            IR_INT_TF_LEVEL_CLR | \
                                            IR_INT_TF_OF_CLR    | \
                                            IR_INT_TX_FINISH_CLR) //!< Check if the input parameter is valid.
#else
#define IR_TX_INT_ALL_CLR                  (IR_INT_TF_EMPTY_CLR | \
                                            IR_INT_TF_LEVEL_CLR | \
                                            IR_INT_TF_OF_CLR) //!< Check if the input parameter is valid.
#endif

/* Clear all interrupts in receiving mode */
#define IR_INT_RF_FULL_CLR                         BIT0  //!< Clear RX FIFO full interrupt status.
#define IR_INT_RF_LEVEL_CLR                        BIT1  //!< Clear RX FIFO threshold interrupt status.
#define IR_INT_RX_CNT_OF_CLR                       BIT2  //!< Clear RX counter overflow interrupt status.
#define IR_INT_RF_OF_CLR                           BIT3  //!< Clear RX FIFO overflow interrupt status.
#define IR_INT_RX_CNT_THR_CLR                      BIT4  //!< Clear RX counter timeout interrupt status.
#define IR_INT_RF_ERROR_CLR                        BIT5  //!< Clear RX FIFO error read interrupt status.
#define IR_INT_RX_FALLING_EDGE_CLR                 BIT6  //!< Clear RX falling edge interrupt status.
#define IR_INT_RX_RISING_EDGE_CLR                  BIT7  //!< Clear RX rising edge interrupt status.
#define IR_RF_CLR                                  BIT8  //!< Clear RX FIFO interrupt status.

#define IR_RX_INT_ALL_CLR                (IR_INT_RF_FULL_CLR | IR_INT_RF_LEVEL_CLR | \
                                          IR_INT_RX_CNT_OF_CLR | IR_INT_RF_OF_CLR | \
                                          IR_INT_RX_CNT_THR_CLR | IR_INT_RF_ERROR_CLR | \
                                          IR_INT_RX_RISING_EDGE_CLR|IR_INT_RX_FALLING_EDGE_CLR) //!< Check if the input parameter is valid.

