yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/ir/inc/rtl_ir.h
#if (IR_SUPPORT_TX_FINISH_INTERRUPT == 1)
#define IS_IR_INT_CLEAR(INT)            (((INT) == IR_INT_TF_EMPTY_CLR) || ((INT) == IR_INT_TF_LEVEL_CLR) || \
                                         ((INT) == IR_INT_TF_OF_CLR) || ((INT) == IR_INT_TX_FINISH_CLR) || ((INT) == IR_INT_RF_FULL_CLR) || \
                                         ((INT) == IR_INT_RF_LEVEL_CLR) || ((INT) == IR_INT_RX_CNT_OF_CLR) || \
                                         ((INT) == IR_INT_RF_OF_CLR) || ((INT) == IR_INT_RX_CNT_THR_CLR) || \
                                         ((INT) == IR_INT_RX_RISING_EDGE_CLR) || ((INT) == IR_INT_RX_FALLING_EDGE_CLR) || \
                                         ((INT) == IR_INT_RF_ERROR_CLR)) //!< Check if the input parameter is valid.
#else
#define IS_IR_INT_CLEAR(INT)            (((INT) == IR_INT_TF_EMPTY_CLR) || ((INT) == IR_INT_TF_LEVEL_CLR) || \
                                         ((INT) == IR_INT_TF_OF_CLR) || ((INT) == IR_INT_RF_FULL_CLR) || \
                                         ((INT) == IR_INT_RF_LEVEL_CLR) || ((INT) == IR_INT_RX_CNT_OF_CLR) || \
                                         ((INT) == IR_INT_RF_OF_CLR) || ((INT) == IR_INT_RX_CNT_THR_CLR) || \
                                         ((INT) == IR_INT_RX_RISING_EDGE_CLR) || ((INT) == IR_INT_RX_FALLING_EDGE_CLR) || \
                                         ((INT) == IR_INT_RF_ERROR_CLR)) //!< Check if the input parameter is valid.
#endif

/** End of IR_Interrupts_Clear_Flag
  * \}
  */

/**
 * \defgroup    IR_Flag IR Flag
 * \{
 * \ingroup     IR_Exported_Constants
 */
#define IR_FLAG_TF_EMPTY                       BIT15 //!< TX FIFO is empty or not.
#define IR_FLAG_TF_FULL                        BIT14 //!< TX FIFO is full or not.
#define IR_FLAG_TX_RUN                         BIT4  //!< TX state is running or idle.
#define IR_FLAG_RF_EMPTY                       BIT17 //!< RX FIFO is empty or not.
#define IR_FLAG_RF_FULL                        BIT16 //!< RX FIFO is full or not.
#define IR_FLAG_RX_RUN                         BIT7  //!< RX state is running or idle.

#define IS_IR_FLAG(FLAG)                (((FLAG) == IR_FLAG_TF_EMPTY) || ((FLAG) == IR_FLAG_TF_FULL) || \
                                         ((FLAG) == IR_FLAG_TX_RUN) || ((FLAG) == IR_FLAG_RF_EMPTY) || \
                                         ((FLAG) == IR_FLAG_RF_FULL) || ((FLAG) == IR_FLAG_RX_RUN)) //!< Check if the input parameter is valid.

/** End of IR_Flag
  * \}
  */

#if (IR_SUPPORT_RAP_FUNCTION == 1)
/**
 * \defgroup    IR_Qactive_Force TIM Qactive Force
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_QACTIVE_ICG_PCLK = 0x0,
    IR_QACTIVE_FW_FORCE_SCLK = 0x1,
    IR_QACTIVE_FW_FORCE_PCLK = 0x2,
} IRQactive_TypeDef;

/** End of IR_Qactive_Force
  * \}
  */

/**
 * \defgroup    IR_Task TIM Task
 * \{
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_TASK_START_RX = 0,
    IR_TASK_START_TX = 1,
} IRTask_TypeDef;

/** End of IR_Task
  * \}
  */
#endif

/** End of IR_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup IR_Exported_Types IR Exported Types
  * \brief
  * \{
  */

/**
 * \brief       IR init structure definition.
 *
 * \ingroup     IR_Exported_Types
 */
typedef struct
{
    IRClock_TypeDef IR_Clock;                         /*!< Specify the source clock frequency.
                                                           This parameter can be a value of \ref IR_Clock. */

    uint32_t IR_Freq;                                 /*!< Specify the clock frequency.
                                                           This parameter is IR carrier freqency whose unit is Hz. */

    float IR_DutyCycle;                               /*!< Specify the IR duty cycle. */

    IRMode_TypeDef IR_Mode;                           /*!< Specify the IR mode.
                                                           This parameter can be a value of \ref IR_Mode. */

    IRIdleStatus_TypeDef IR_TxIdleLevel;              /*!< Specify the IR output level in Tx mode.
                                                           This parameter can be a value of \ref IR_Idle_Status. */

    IRTxDataType_TypeDef
    IR_TxInverse;                                     /*!< Specify inverse FIFO data or not in TX mode.
                                                           This parameter can be a value of \ref IR_TX_Data_Type. */

    uint32_t IR_TxFIFOThrLevel;                       /*!< Specify TX FIFO interrupt threshold in TX mode.
                                                           When TX FIFO depth <= threshold value, trigger interrupt.
                                                           This parameter can be a value of 1 ~ 32. */

    IRRxStartMode_TypeDef IR_RxStartMode;             /*!< Specify Start mode in RX mode.
                                                           This parameter can be a value of \ref IR_RX_Start_Mode. */

    uint32_t IR_RxFIFOThrLevel;                       /*!< Specify RX FIFO interrupt threshold in RX mode.
                                                           When RX FIFO depth > threshold value, trigger interrupt.
                                                           This parameter can be a value of 1 ~ 32. */

    IRRxFifoDiscardSetting_TypeDef
    IR_RxFIFOFullCtrl; /*!< Specify data discard mode in RX mode when RX FIFO is full and receiving new data.
                                                           This parameter can be a value of \ref IR_RX_FIFO_Discard_Setting. */

    IRRxTriggerMode_TypeDef IR_RxTriggerMode;         /*!< Specify trigger in RX mode.
                                                           This parameter can be a value of \ref IR_RX_Trigger_Mode. */

    IRRxFilterTime_TypeDef IR_RxFilterTime;           /*!< Specify filter time in RX mode.
                                                           This parameter can be a value of \ref IR_RX_Filter_Time. */

    IRRxCounterThresholdType_TypeDef
    IR_RxCntThrType; /*!< Specify counter level type when trigger IR_INT_RX_CNT_THR interrupt in RX mode.
                                                           This parameter can be a value of \ref IR_RX_Counter_Level. */

    uint32_t IR_RxCntThr;                             /*!< Specify counter threshold value
                                                           when trigger IR_INT_RX_CNT_THR interrupt in RX mode. */

    FunctionalState IR_TxDmaEn;                       /*!< Specify the Tx dma mode.
                                                           This parameter must be a value of DISABLE and ENABLE. */

    uint8_t IR_TxWaterLevel;                          /*!< Specify the DMA tx water level.
                                                           This parameter must range from 0 to 32.*/

