yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/ir/inc/rtl_ir.h
    FunctionalState IR_RxDmaEn;                       /*!< Specify the Rx dma mode.
                                                           This parameter must be a value of DISABLE and ENABLE. */

    uint8_t IR_RxWaterLevel;                          /*!< Specify the DMA rx water level.
                                                           This parameter must range from 0 to 32.*/

#if IR_SUPPORT_TX_MODE_CONFIG
    IRTxOutputMode_TypeDef
    IR_TxOutputMode;                                  /*!< Specify the IR Tx output mode.
                                                           This parameter can be a value of \ref IR_TxOutputMode. */
#endif
} IR_InitTypeDef;

/** End of IR_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup IR_Exported_Functions IR Exported Functions
  * \brief
  * \{
  */

/**
 * \brief Deinitialize the IR peripheral registers to their default values.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_ir_init(void)
 * {
 *     IR_DeInit();
 * }
 * \endcode
 */
void IR_DeInit(void);

/**
 * \brief   Initialize the IR peripheral according to the specified
 *          parameters in IR_InitStruct.
 *
 * \param[in] IR_InitStruct  Pointer to a IR_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_ir_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_IR, APBPeriph_IR_CLOCK, ENABLE);
 *
 *     IR_InitTypeDef IR_InitStruct;
 *     IR_StructInit(&IR_InitStruct);
 *
 *     IR_InitStruct.IR_Freq               = 38000;
 *     IR_InitStruct.IR_Mode               = IR_MODE_RX;
 *     IR_InitStruct.IR_RxStartMode        = IR_RX_AUTO_MODE;
 *     IR_InitStruct.IR_RxFIFOThrLevel     = IR_RX_FIFO_THR_LEVEL;
 *     IR_InitStruct.IR_RxFIFOFullCtrl     = IR_RX_FIFO_FULL_DISCARD_NEWEST;
 *     IR_InitStruct.IR_RxFilterTime       = IR_RX_FILTER_TIME_50ns;
 *     IR_InitStruct.IR_RxTriggerMode      = IR_RX_FALL_EDGE;
 *     IR_InitStruct.IR_RxCntThrType       = IR_RX_Count_High_Level;
 *     IR_InitStruct.IR_RxCntThr           = 0x1F40;
 *     IR_Init(&IR_InitStruct);
 *     IR_Cmd(IR_MODE_RX, ENABLE);
 *     IR_ClearRxFIFO();
 * }
 * \endcode
 */
void IR_Init(IR_InitTypeDef *IR_InitStruct);

/**
 * \brief  Fills each IR_InitStruct member with its default value.
 *
 * \note   The default settings for the IR_InitStruct member are shown in the following table:
 *         | IR_InitStruct member  | Default value                            |
 *         |:---------------------:|:----------------------------------------:|
 *         | IR_Clock              | \ref IR_CLOCK_40M                        |
 *         | IR_Freq               | 38000                                    |
 *         | IR_DutyCycle          | 3                                        |
 *         | IR_Mode               | \ref IR_MODE_TX                          |
 *         | IR_TxIdleLevel        | \ref IR_IDLE_OUTPUT_LOW                  |
 *         | IR_TxInverse          | \ref IR_TX_DATA_NORMAL                   |
 *         | IR_TxFIFOThrLevel     | 0                                        |
 *         | IR_RxStartMode        | \ref IR_RX_AUTO_MODE                     |
 *         | IR_RxFIFOThrLevel     | 0                                        |
 *         | IR_RxFIFOFullCtrl     | \ref IR_RX_FIFO_FULL_DISCARD_NEWEST      |
 *         | IR_RxTriggerMode      | \ref IR_RX_FALL_EDGE                     |
 *         | IR_RxFilterTime       | \ref IR_RX_FILTER_TIME_50ns              |
 *         | IR_RxCntThrType       | \ref IR_RX_Count_Low_Level               |
 *         | IR_RxCntThr           | 0x23a                                    |
 *         | IR_TxDmaEn            | DISABLE                                  |
 *         | IR_TxWaterLevel       | 31                                       |
 *         | IR_RxDmaEn            | DISABLE                                  |
 *         | IR_RxWaterLevel       | 1                                        |
 *
 * \param[in] IR_InitStruct: Pointer to an IR_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_ir_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_IR, APBPeriph_IR_CLOCK, ENABLE);
 *
 *     IR_InitTypeDef IR_InitStruct;
 *     IR_StructInit(&IR_InitStruct);
 *
 *     IR_InitStruct.IR_Freq               = 38000;
 *     IR_InitStruct.IR_Mode               = IR_MODE_RX;
 *     IR_InitStruct.IR_RxStartMode        = IR_RX_AUTO_MODE;
 *     IR_InitStruct.IR_RxFIFOThrLevel     = IR_RX_FIFO_THR_LEVEL;
 *     IR_InitStruct.IR_RxFIFOFullCtrl     = IR_RX_FIFO_FULL_DISCARD_NEWEST;
 *     IR_InitStruct.IR_RxFilterTime       = IR_RX_FILTER_TIME_50ns;
 *     IR_InitStruct.IR_RxTriggerMode      = IR_RX_FALL_EDGE;
 *     IR_InitStruct.IR_RxCntThrType       = IR_RX_Count_High_Level;
 *     IR_InitStruct.IR_RxCntThr           = 0x1F40;
 *     IR_Init(&IR_InitStruct);
 *     IR_Cmd(IR_MODE_RX, ENABLE);
 *     IR_ClearRxFIFO();
 * }
 * \endcode
 */
void IR_StructInit(IR_InitTypeDef *IR_InitStruct);

/**
 * \brief   Enable or disable the selected IR mode.
 *
 * \param[in] mode      Selected IR operation mode.
 *                      This parameter can be one of the following values:
 *                      \arg IR_MODE_TX: Transmission mode.
 *                      \arg IR_MODE_RX: Receiving mode.
 * \param[in] NewState  New state of the operation mode.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the selected IR mode.
 *                      - DISABLE: Disable the selected IR mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_ir_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_IR, APBPeriph_IR_CLOCK, ENABLE);
 *
 *     IR_InitTypeDef IR_InitStruct;
 *     IR_StructInit(&IR_InitStruct);
 *
 *     IR_InitStruct.IR_Freq               = 38000;
 *     IR_InitStruct.IR_Mode               = IR_MODE_RX;
 *     IR_InitStruct.IR_RxStartMode        = IR_RX_AUTO_MODE;
 *     IR_InitStruct.IR_RxFIFOThrLevel     = IR_RX_FIFO_THR_LEVEL;
 *     IR_InitStruct.IR_RxFIFOFullCtrl     = IR_RX_FIFO_FULL_DISCARD_NEWEST;
 *     IR_InitStruct.IR_RxFilterTime       = IR_RX_FILTER_TIME_50ns;
 *     IR_InitStruct.IR_RxTriggerMode      = IR_RX_FALL_EDGE;
 *     IR_InitStruct.IR_RxCntThrType       = IR_RX_Count_High_Level;
 *     IR_InitStruct.IR_RxCntThr           = 0x1F40;
 *     IR_Init(&IR_InitStruct);
 *     IR_Cmd(IR_MODE_RX, ENABLE);
 *     IR_ClearRxFIFO();
 * }
 * \endcode
 */
void IR_Cmd(uint32_t mode, FunctionalState NewState);

/**
 * \brief Start trigger receive, only in manual receive mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_StartManualRxTrigger();
 * }
 * \endcode
 */
void IR_StartManualRxTrigger(void);

/**
 * \brief   Config counter threshold value in receiving mode. You can use it to stop receiving IR data.
 *
 * \param[in] IR_RxCntThrType  Count threshold type.
 *                             This parameter can be the following values:
 *                             \arg IR_RX_Count_Low_Level: Low level counter value >= IR_RxCntThr, trigger IR_INT_RX_CNT_THR interrupt.
 *                             \arg IR_RX_Count_High_Level: High level counter value >= IR_RxCntThr, trigger IR_INT_RX_CNT_THR interrupt.
 * \param[in] IR_RxCntThr      Configure IR Rx counter threshold value which can be 0 to 0x7fffffffUL.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SetRxCounterThreshold(IR_RX_Count_Low_Level, 0x100);
 * }
 * \endcode
 */
void IR_SetRxCounterThreshold(uint32_t IR_RxCntThrType, uint32_t IR_RxCntThr);

/**
 * \brief   Send data.
 *
 * \param[in] pBuf          Data buffer to send.
 * \param[in] len           Send data length.
 * \param[in] IsLastPacket  Is it the last package of data.
 *                          This parameter can be one of the following values:
 *                          - ENABLE: The last data in IR packet and there is no continous data.
 *                            In other words, an infrared data transmission is completed.
 *                          - DISABLE: There is data to be transmitted continuously.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t data_buf[80] = {0};
 *     IR_SendBuf(data_buf, 68, DISABLE);
 * }
 * \endcode
 */
void IR_SendBuf(uint32_t *pBuf, uint32_t len, FunctionalState IsLastPacket);

/**
 * \brief  Send compensation data.
 *
 * \param[in] comp_type     Compensation data type.
 *                          This parameter can be one of the following values:
 *                          \arg IR_COMPEN_FLAG_1_2_CARRIER: 1/2 carrier freqency.
 *                          \arg IR_COMPEN_FLAG_1_4_CARRIER: 1/4 carrier freqency.
 *                          \arg IR_COMPEN_FLAG_1_N_SYSTEM_CLK: MOD((0x48[27:16]+0x00[11:0]), 4095)/40MHz.
 *                          User can call function of IR_ConfigCompParam to configure 0x48[27:16].
 * \param[in] buf           Data buffer to send.
 * \param[in] length        Data length.
 * \param[in] IsLastPacket  Is it the last package of data.
 *                          This parameter can be the following values:
 *                          - ENABLE: The last data in IR packet and there is no continous data.
 *                            In other words, an infrared data transmission is completed.
 *                          - DISABLE: There is data to be transmitted continuously.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t data_buf[80] = {0};
 *     IR_SendCompenBuf(IR_COMPEN_FLAG_1_2_CARRIER, data_buf, 68, DISABLE);
 * }
 * \endcode
 */
void IR_SendCompenBuf(IRTxCompen_TypeDef comp_type, uint32_t *pBuf, uint32_t len,
                      FunctionalState IsLastPacket);

/**
 * \brief   Read data From RX FIO.
 *
 * \param[in] pBuf    Buffer address to receive data.
 * \param[in] length  Read data length.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t data_buf[80] = {0};
 *     IR_ReceiveBuf(data_buf, 68);
 * }
 * \endcode
 */
void IR_ReceiveBuf(uint32_t *pBuf, uint32_t length);

/**
 * \brief     Enable or disable the specified IR interrupt source.
 *
 * \param[in] IR_INT    Specify the IR interrupt source to be enabled or disabled.
 *                      This parameter can be oen of the following values, refer to \ref IR_Interrupt.
 *                      \arg IR_INT_TF_EMPTY: TX FIFO empty interrupt source.
 *                      \arg IR_INT_TF_LEVEL: TX FIFO threshold interrupt source.
 *                      \arg IR_INT_TF_OF: TX FIFO overflow interrupt source.
 *                      \arg IR_INT_RF_FULL: RX FIFO  full interrupt source.
 *                      \arg IR_INT_RF_LEVEL: RX FIFO threshold interrupt source.
 *                      \arg IR_INT_RX_CNT_OF: RX counter overflow interrupt source.
 *                      \arg IR_INT_RF_OF: RX FIFO overflow interrupt source.
 *                      \arg IR_INT_RX_CNT_THR: RX counter threshold interrupt source.
 *                      \arg IR_INT_RF_ERROR: RX FIFO error read interrupt source. Trigger when RX FIFO empty and read RX FIFO.
 *                      \arg IR_INT_RISING_EDGE: IR RX Rising edge interrupt.
 *                      \arg IR_INT_FALLING_EDGE: IR RX Falling edge interrupt.
 * \param[in] NewState  New state of the specified IR interrupt.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the specified IR interrupt source.
 *                      - DISABLE: Disable the specified IR interrupt source.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_INTConfig(IR_INT_TF_EMPTY, ENABLE);
 * }
 * \endcode
 */
void IR_INTConfig(uint32_t IR_INT, FunctionalState NewState);

/**
 * \brief     Mask or unmask the specified IR interrupt source.
 *
 * \param[in] IR_INT    Specify the IR interrupts sources to be mask or unmask.
 *                      This parameter can be the following values, refer to \ref IR_Interrupt.
 *                      \arg IR_INT_TF_EMPTY: TX FIFO empty interrupt.
 *                      \arg IR_INT_TF_LEVEL: TX FIFO threshold interrupt.
 *                      \arg IR_INT_TF_OF: TX FIFO overflow interrupt.
 *                      \arg IR_INT_RF_FULL: RX FIFO  full interrupt.
 *                      \arg IR_INT_RF_LEVEL: RX FIFO threshold interrupt.
 *                      \arg IR_INT_RX_CNT_OF: RX counter overflow interrupt.
 *                      \arg IR_INT_RF_OF: RX FIFO overflow interrupt.
 *                      \arg IR_INT_RX_CNT_THR: RX counter threshold interrupt.
 *                      \arg IR_INT_RF_ERROR: RX FIFO error read interrupt. Trigger when RX FIFO empty and read RX FIFO.
 *                      \arg IR_INT_RISING_EDGE: IR RX Rising edge interrupt.
 *                      \arg IR_INT_FALLING_EDGE: IR RX Falling edge interrupt.
 * \param[in] NewState  New state of the specified IR interrupts.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Mask the specified IR interrupt source.
 *                      - DISABLE: Unmask the specified IR interrupt source.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_MaskINTConfig(IR_INT_TF_EMPTY, ENABLE);
 * }
 * \endcode
 */
void IR_MaskINTConfig(uint32_t IR_INT, FunctionalState NewState);

/**
 * \brief     Get the specified IR interrupt status.
 *
 * \param[in] IR_INT  The specified IR interrupts.
 *                    This parameter can be one of the following values, refer to \ref IR_Interrupt.
 *                    \arg IR_INT_TF_EMPTY: TX FIFO empty interrupt.
 *                    \arg IR_INT_TF_LEVEL: TX FIFO threshold interrupt.
 *                    \arg IR_INT_TF_OF: TX FIFO overflow interrupt.
 *                    \arg IR_INT_RF_FULL: RX FIFO  full interrupt.
 *                    \arg IR_INT_RF_LEVEL: RX FIFO threshold interrupt.
 *                    \arg IR_INT_RX_CNT_OF: RX counter overflow interrupt.
 *                    \arg IR_INT_RF_OF: RX FIFO overflow interrupt.
 *                    \arg IR_INT_RX_CNT_THR: RX counter threshold interrupt.
 *                    \arg IR_INT_RF_ERROR: RX FIFO error read interrupt. Trigger when RX FIFO empty and read RX FIFO.
 *                    \arg IR_INT_RISING_EDGE: IR RX Rising edge interrupt.
 *                    \arg IR_INT_FALLING_EDGE: IR RX Falling edge interrupt.
 *
 * \return  The status of IR interrupt.
 *          - SET: The IR interrupt status is set.
 *          - RESET: The IR interrupt status is not set.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     ITStatus int_status = IR_GetINTStatus(IR_INT_TF_EMPTY);
 * }
 * \endcode
 */
ITStatus IR_GetINTStatus(uint32_t IR_INT);

/**
 * \brief     Clear the IR interrupt pending bit.
 *
 * \param[in] IR_CLEAR_INT  Specify the interrupt pending bit to clear.
 *                          This parameter can be any combination of the following values, refer to \ref IR_Interrupts_Clear_Flag.
 *                          - IR_INT_TF_EMPTY_CLR: Clear TX FIFO empty interrupt.
 *                          - IR_INT_TF_LEVEL_CLR: Clear TX FIFO threshold interrupt.
 *                          - IR_INT_TF_OF_CLR: Clear TX FIFO overflow interrupt.
 *                          - IR_INT_RF_FULL_CLR: Clear RX FIFO  full interrupt.
 *                          - IR_INT_RF_LEVEL_CLR: Clear RX FIFO threshold interrupt.
 *                          - IR_INT_RX_CNT_OF_CLR: Clear RX counter overflow interrupt.
 *                          - IR_INT_RF_OF_CLR: Clear RX FIFO overflow interrupt.
 *                          - IR_INT_RX_CNT_THR_CLR: Clear RX counter threshold interrupt.
 *                          - IR_INT_RF_ERROR_CLR: Clear RX FIFO error read interrupt. Trigger when RX FIFO empty and read RX FIFO.
 *                          - IR_INT_RX_RISING_EDGE_CLR: Clear RX Rising edge interrupt.
 *                          - IR_INT_RX_FALLING_EDGE_CLR: Clear RX Falling edge interrupt.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_ClearINTPendingBit(IR_INT_RX_CNT_OF_CLR);
 * }
 * \endcode
 */
void IR_ClearINTPendingBit(uint32_t IR_CLEAR_INT);

/**
 * \brief Get free size of TX FIFO.
 *
 * \return The free size of TX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint16_t data_len = IR_GetTxFIFOFreeLen();
 * }
 * \endcode
 */
uint16_t IR_GetTxFIFOFreeLen(void);

/**
 * \brief Get data size in RX FIFO.
 *
 * \return Current data size in RX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint16_t data_len = IR_GetRxDataLen();
 * }
 * \endcode
 */
uint16_t IR_GetRxDataLen(void);

/**
 * \brief   Send one data.
 *
 * \param[in] data  Send data.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SendData(0x80000100);
 * }
 * \endcode
 */
void IR_SendData(uint32_t data);

/**
 * \brief Read one data.
 *
 * \return Data which read from RX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t data = IR_ReceiveData();
 * }
 * \endcode
 */
uint32_t IR_ReceiveData(void);

/**
 * \brief  Set tx threshold, when TX FIFO depth <= threshold value trigger interrupt.
 *
 * \param[in] thd  Tx threshold.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SetTxThreshold(30);
 * }
 * \endcode
 */
void IR_SetTxThreshold(uint8_t thd);

/**
 * \brief   Set tx threshold, when RX FIFO depth >= threshold value trigger interrupt.
 *
 * \param[in] thd  Rx threshold.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SetRxThreshold(2);
 * }
 * \endcode
 */
void IR_SetRxThreshold(uint8_t thd);

/**
 * \brief Get IR RX current count.
 *
 * \return Current counter.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t count = IR_GetRxCurrentCount();
 * }
 * \endcode
 */
uint32_t IR_GetRxCurrentCount(void);

/**
 * \brief Clear IR TX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_ClearTxFIFO();
 * }
 * \endcode
 */
void IR_ClearTxFIFO(void);

/**
 * \brief Clear IR RX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_ClearRxFIFO();
 * }
 * \endcode
 */
void IR_ClearRxFIFO(void);

/**
 * \brief  Get the specified IR flag status.
 *
 * \param[in] IR_FLAG  Specify the flag to check.
 *                     This parameter can be one of the following values, refer to \ref IR_Flag.
 *                     \arg IR_FLAG_TF_EMPTY: TX FIFO empty or not. If SET, TX FIFO is empty.
 *                     \arg IR_FLAG_TF_FULL: TX FIFO full or not. If SET, TX FIFO is full.
 *                     \arg IR_FLAG_TX_RUN: TX run or not. If SET, TX is running.
 *                     \arg IR_FLAG_RF_EMPTY: RX FIFO empty or not. If SET, RX FIFO is empty.
 *                     \arg IR_FLAG_RF_FULL: RX FIFO full or not. If SET, RX FIFO is full.
 *                     \arg IR_FLAG_RX_RUN: RX run or not. If SET, RX is running.
 *
 * \return  The status of IR flag.
 *          - SET: The IR flag is set.
 *          - RESET: The IR flag is reset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     FlagStatus flag_status = IR_GetFlagStatus(IR_FLAG_TF_EMPTY);
 * }
 * \endcode
 */
FlagStatus IR_GetFlagStatus(uint32_t IR_FLAG);

/**
 * \brief   Set or reset tx data inverse.
 *
 * \param[in] NewState  This parameter can be: ENABLE or DISABLE.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SetTxInverse(ENABLE);
 * }
 * \endcode
 */
void IR_SetTxInverse(FunctionalState NewState);

/**
 * \brief  Enbale TX output inverse or not.
 *
 * \param[in] NewState  This parameter can be: ENABLE or DISABLE.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_TxOutputInverse(ENABLE);
 * }
 * \endcode
 */
void IR_TxOutputInverse(FunctionalState NewState);

/**
 * \brief Get IR RX Level.
 *
 * \return Current Level.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t level = IR_GetRxCurrentLevel();
 * }
 * \endcode
 */
uint32_t IR_GetRxCurrentLevel(void);

/**
 * \brief  IR clock config.
 *
 * \param[in]  ClockSrc  Specify the clock source to gates its clock.
 * \param[in]  ClockDiv  Specify the clock divide to gates its clock.
 */
void IR_ClkConfig(IRClockSrc_TypeDef ClockSrc, IRClockDiv_TypeDef ClockDiv);

/**
 * \brief  Get IR clock config.
 *
 * \param[in]  ClockSrc  Specify the clock source to gates its clock.
 * \param[in]  ClockDiv  Specify the clock divide to gates its clock.
 *
 * \return The status of get clock.
 */
bool IR_ClkGet(IRClockSrc_TypeDef *ClockSrc, IRClockDiv_TypeDef *ClockDiv);

#if (IR_SUPPORT_RAP_FUNCTION == 1)
void IR_RAPModeCmd(FunctionalState NewState);

void IR_RAPQactiveCtrl(uint32_t Qactive, FunctionalState NewState);

void IR_TaskTrigger(uint32_t Task);
#endif

/** End of IR_Exported_Functions
  * \}
  */

/** End of IR
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /* RTL_IR_H */



